{
    "Actinic keratosis":{
        "Description":"Actinic keratosis is a rough, scaly patch of skin that develops on areas of the body that are often exposed to the sun. It is caused by damage to the skin from ultraviolet (UV) rays. Actinic keratosis is a precancerous condition. It is not cancer, but it can develop into squamous cell carcinoma, a type of skin cancer. Actinic keratosis is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure. Actinic keratosis is not contagious.",
        "Symptoms":"Actinic keratosis usually appears as a rough, scaly patch of skin. It may be pink, red, or brown. It may be raised or flat. It may be itchy or painful. Actinic keratosis may be mistaken for other skin conditions, such as psoriasis, eczema, or a wart.",
        "Causes":"Actinic keratosis is caused by damage to the skin from ultraviolet (UV) rays. It is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Risk Factors":"Actinic keratosis is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Diagnosis":"Your doctor will examine your skin and ask about your medical history and symptoms. Your doctor may take a biopsy of the skin growth to confirm the diagnosis.",
        "Treatment":"Actinic keratosis is treated with a topical cream or ointment. Your doctor may also use a laser to treat actinic keratosis. If actinic keratosis is not treated, it can develop into squamous cell carcinoma, a type of skin cancer.",
        "Prevention":"There is no known way to prevent actinic keratosis."

    },
    "basal cell carcinoma":{
        "Description ":"Basal cell carcinoma is a type of skin cancer that begins in the basal cells of the skin. Basal cells are the most common type of cell in the skin. Basal cell carcinoma is the most common type of skin cancer. It is not contagious. Basal cell carcinoma is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Symptoms":"Basal cell carcinoma usually appears as a small, pearly, pink, or flesh-colored bump. It may be raised or flat. It may be itchy or painful. Basal cell carcinoma may be mistaken for other skin conditions, such as a wart, a mole, or eczema.",
        "Causes":"Basal cell carcinoma is caused by damage to the skin from ultraviolet (UV) rays. It is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Risk Factors":"Basal cell carcinoma is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Diagnosis":"Your doctor will examine your skin and ask about your medical history and symptoms. Your doctor may take a biopsy of the skin growth to confirm the diagnosis.",
        "Treatment":"Basal cell carcinoma is treated with surgery, radiation therapy, or chemotherapy. If basal cell carcinoma is not treated, it can spread to other parts of the body.",
        "Prevention":"There is no known way to prevent basal cell carcinoma."

    },
    "benign keratosis":{
        "Description ":"Benign keratosis is a common skin condition that causes rough, scaly patches of skin. It is not contagious. Benign keratosis is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Symptoms":"Benign keratosis usually appears as a rough, scaly patch of skin. It may be pink, red, or brown. It may be raised or flat. It may be itchy or painful. Benign keratosis may be mistaken for other skin conditions, such as psoriasis, eczema, or a wart.",
        "Causes":"Benign keratosis is caused by damage to the skin from ultraviolet (UV) rays. It is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Risk Factors":"Benign keratosis is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Diagnosis":"Your doctor will examine your skin and ask about your medical history and symptoms. Your doctor may take a biopsy of the skin growth to confirm the diagnosis.",
        "Treatment":"Benign keratosis is treated with a topical cream or ointment. Your doctor may also use a laser to treat benign keratosis. If benign keratosis is not treated, it can develop into squamous cell carcinoma, a type of skin cancer.",
        "Prevention":"There is no known way to prevent benign keratosis."

    },
    "dermatofibromas":{
        "Description":"Dermatofibromas are benign, noncancerous (benign) growths of the skin. They are usually flesh-colored or pink and are most often found on the legs, arms, and trunk. They are usually less than 1 inch (2.5 centimeters) in diameter. Dermatofibromas are not contagious.",
        "Symptoms":"Dermatofibromas are usually painless. They may itch or bleed if scratched. Dermatofibromas may be mistaken for other skin conditions, such as warts, moles, or skin tags.",
        "Causes":"The cause of dermatofibromas is unknown. They are more common in people with darker skin.",
        "Risk Factors":"Dermatofibromas are more common in people with darker skin. They are also more common in people with a family history of dermatofibromas.",
        "Diagnosis":"Your doctor will examine your skin and ask about your medical history and symptoms. Your doctor may take a biopsy of the skin growth to confirm the diagnosis.",
        "Treatment":"Dermatofibromas are usually not treated. If they are bothersome, your doctor may remove them with a scalpel or laser. If the dermatofibromas are on your face, your doctor may use a chemical peel to remove them.",
        "Prevention":"There is no known way to prevent dermatofibromas."
    },
    "melanocyctic nevus":{
        "Description":"Melanocytic nevi are benign, noncancerous (benign) growths of the skin. They are usually brown or black and are most often found on the legs, arms, and trunk. They are usually less than 1 inch (2.5 centimeters) in diameter. Melanocytic nevi are not contagious.",
        "Symptoms":"Melanocytic nevi are usually painless. They may itch or bleed if scratched. Melanocytic nevi may be mistaken for other skin conditions, such as warts, moles, or skin tags.",
        "Causes":"The cause of melanocytic nevi is unknown. They are more common in people with darker skin.",
        "Risk Factors":"Melanocytic nevi are more common in people with darker skin. They are also more common in people with a family history of melanocytic nevi.",
        "Diagnosis":"Your doctor will examine your skin and ask about your medical history and symptoms. Your doctor may take a biopsy of the skin growth to confirm the diagnosis.",
        "Treatment":"Melanocytic nevi are usually not treated. If they are bothersome, your doctor may remove them with a scalpel or laser. If the melanocytic nevi are on your face, your doctor may use a chemical peel to remove them.",
        "Prevention":"There is no known way to prevent melanocytic nevi."
    },
    "squamous cell carcinoma":{
        "Description ":"Squamous cell carcinoma is a type of skin cancer that begins in the squamous cells of the skin. Squamous cells are the second most common type of cell in the skin. Squamous cell carcinoma is not contagious. Squamous cell carcinoma is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Symptoms":"Squamous cell carcinoma usually appears as a small, pearly, pink, or flesh-colored bump. It may be raised or flat. It may be itchy or painful. Squamous cell carcinoma may be mistaken for other skin conditions, such as a wart, a mole, or eczema.",
        "Causes":"Squamous cell carcinoma is caused by damage to the skin from ultraviolet (UV) rays. It is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Risk Factors":"Squamous cell carcinoma is more common in people who have fair skin, light hair, and blue, green, or gray eyes. It is also more common in people who have had a lot of sun exposure.",
        "Diagnosis":"Your doctor will examine your skin and ask about your medical history and symptoms. Your doctor may take a biopsy of the skin growth to confirm the diagnosis.",
        "Treatment":"Squamous cell carcinoma is treated with surgery, radiation therapy, or chemotherapy. If squamous cell carcinoma is not treated, it can spread to other parts of the body.",
        "Prevention":"There is no known way to prevent squamous cell carcinoma."

    },
    "vascular lesion":{
        "Description":"Vascular lesions are benign, noncancerous (benign) growths of the skin. They are usually flesh-colored or pink and are most often found on the legs, arms, and trunk. They are usually less than 1 inch (2.5 centimeters) in diameter. Vascular lesions are not contagious.",
        "Symptoms":"Vascular lesions are usually painless. They may itch or bleed if scratched. Vascular lesions may be mistaken for other skin conditions, such as warts, moles, or skin tags.",
        "Causes":"The cause of vascular lesions is unknown. They are more common in people with darker skin.",
        "Risk Factors":"Vascular lesions are more common in people with darker skin. They are also more common in people with a family history of vascular lesions.",
        "Diagnosis":"Your doctor will examine your skin and ask about your medical history and symptoms. Your doctor may take a biopsy of the skin growth to confirm the diagnosis.",
        "Treatment":"Vascular lesions are usually not treated. If they are bothersome, your doctor may remove them with a scalpel or laser. If the vascular lesions are on your face, your doctor may use a chemical peel to remove them.",
        "Prevention":"There is no known way to prevent vascular lesions."
    }
}
    
    
    


    
